//
//  DetailModel1.swift
//  MotoControll
//
//  Created by Polina on 03.11.2023.
//

import Foundation
struct DetailModel1: Identifiable{
    let id = UUID()
    let info: String
    let title1: String
    let info1: String
    let title2: String
    let info2: String
    let title3: String
    let info3: String
    let title4: String
    let info4: String
    let title5: String
    let info5: String
    let title6: String
    let mark1: String
    let mark2: String
    let mark3: String
    let mark4: String
    let info6: String
}

var detailTheme2 = DetailModel1(info: "Правильная посадка при езде на мотоцикле позволяет мотоциклисту не только долгое время не уставать, но также обеспечивает хорошую управляемость мотоцикла.", title1: "ПОСАДКА НА МОТОЦИКЛЕ – В ЧЁМ СЕКРЕТ?", info1: "Секрет правильной посадки мотоциклиста состоит из нескольких важных аспектов, которые стоит рассмотреть по-отдельности. Обрати внимание, что каждая составляющая одинаково необходима для достижения отличного результата. Поэтому, не стоит пренебрегать ни одним пунктом, изложенным ниже. Итак, перейдём к делу.", title2: "РАССЛАБЛЕННЫЕ РУКИ МОТОЦИКЛИСТА", info2: "Краеугольным камнем правильной посадки являются расслабленные руки. Вообще, вся посадка на мотоцикле строится вокруг рук мотоциклиста. Они должны быть полностью расслаблены и немного согнуты в локтях. При рулении руки должны свободно толкать руль, а не давить на него сверху. Чем свободнее лежат руки на руле и чем меньшее воздействие они оказывают на руль (во время, когда руление не требуется), тем лучше работает рулевое управление мотоцикла, которое стабилизирует мотоцикл на его траектории. Поэтому очень важно минимизировать воздействие на руль в любое время кроме руления. Руки должны быть расслабленны! Теперь перейдём к следующему аспекту правильной посадки на мотоцикле, который не менее важен.", title3: "РАСПОЛОЖЕНИЕ СТУПНЕЙ", info3: "Ступни стоит располагать на подножках носками (передней третью стопы), при этом не на краю подножки, а занимая всю ее ширину. Стопы не должны торчать в стороны, иначе они могут травмироваться при маневрировании, зацепившись за асфальт и попав между ним и частями мотоцикла. Ступни не должны торчать в стороны.", title4: "НАКЛОН СПИНЫ", info4: "Наклон спины должен обеспечивать необходимый угол сгиба в локтях. Не стоит прогибать спину, поскольку это увеличивает изгиб шеи. В случае, когда шея сильно изогнута, она быстро устает. Если устаёт шея, голова и взгляд опускаются вниз, а это сильно ухудшает способность к обзору дорожной ситуации. Спина должна быть ровной, плечи свободны, голова должна свободно поворачиваться в стороны. ", title5: "КОЛЕНИ", info5: "Коленями рекомендуется сжимать бак при разгоне, торможении и маневрировании. Это нужно для снятия излишней нагрузки на руки. Важно понять, что при равномерном движении постоянно сжимать бак коленями не требуется.", title6: "ПРАВИЛЬНАЯ ПОСАДКА НА МОТОЦИКЛЕ: ОСНОВНЫЕ ПРИНЦИПЫ", mark1: "1. Руки должны быть расслаблены.", mark2: "2. Спина должна быть ровной, плечи свободны, голова должна свободно поворачиваться в стороны.", mark3: "3. Ступни не должны торчать в стороны.", mark4: "4. При равномерном движении колени не должны постоянно сжимать бак.", info6: "Теперь, когда мы рассмотрели все составляющие правильной посадки на мотоцикле, тебе остаётся проработать каждый пункт по-отдельности, а затем объединить их в единое целое. ")
